Reports/ОтчетЗаказной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ОтчетЗаказной</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ОстаткиПроживающихГостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиПроживающихГостей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СредствоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтажСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтажиСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомнатаСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомнатыСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Гость</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГостиИОрганизаторы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиМестРазмещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМестРазмещения</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СредствоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтажСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтажиСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомнатаСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомнатыСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиМестРазмещенияВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМестРазмещенияВЭксплуатации</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МояОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СредствоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтажСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтажиСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомнатаСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомнатыСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОборотыБронирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыБронирования</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалютеДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТип</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МояОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.События</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронирующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГостиИОрганизаторы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СредствоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтажСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтажиСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомнатаСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомнатыСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОборотыЗаселения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыЗаселения</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СредствоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтажСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтажиСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомнатаСредстваРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомнатыСредствРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРазмещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Гость</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГостиИОрганизаторы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ОтчетЗаказной/Forms/ФормаОтчета/Ext/Form/Module.bsl
///Copyright (c) 2021, https://github.com/Larii75.
///
///Разрешается повторное распространение и использование как в виде исходного кода, так и в двоичной форме, с изменениями или без, при соблюдении следующих условий:
///
///При повторном распространении исходного кода должно оставаться указанное выше уведомление об авторском праве, этот список условий и последующий отказ от гарантий.
///При повторном распространении двоичного кода должна сохраняться указанная выше информация об авторском праве, этот список условий и последующий отказ от гарантий 
///в документации и/или в других материалах, поставляемых при распространении. 
///Ни название <Организации>, ни имена её сотрудников не могут быть использованы в качестве поддержки или продвижения продуктов, основанных на этом ПО без предварительного письменного разрешения.
///ЭТА ПРОГРАММА ПРЕДОСТАВЛЕНА ВЛАДЕЛЬЦАМИ АВТОРСКИХ ПРАВ И/ИЛИ ДРУГИМИ СТОРОНАМИ «КАК ОНА ЕСТЬ» БЕЗ КАКОГО-ЛИБО ВИДА ГАРАНТИЙ, ВЫРАЖЕННЫХ ЯВНО ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ, 
///ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ. 
///НИ В КОЕМ СЛУЧАЕ НИ ОДИН ВЛАДЕЛЕЦ АВТОРСКИХ ПРАВ И НИ ОДНО ДРУГОЕ ЛИЦО, КОТОРОЕ МОЖЕТ ИЗМЕНЯТЬ И/ИЛИ ПОВТОРНО РАСПРОСТРАНЯТЬ ПРОГРАММУ, КАК БЫЛО СКАЗАНО ВЫШЕ, НЕ НЕСЁТ ОТВЕТСТВЕННОСТИ,
///ВКЛЮЧАЯ ЛЮБЫЕ ОБЩИЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ ИЛИ ПОСЛЕДОВАВШИЕ УБЫТКИ, ВСЛЕДСТВИЕ ИСПОЛЬЗОВАНИЯ ИЛИ НЕВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ ПРОГРАММЫ 
///(ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ПОТЕРЕЙ ДАННЫХ, ИЛИ ДАННЫМИ, СТАВШИМИ НЕПРАВИЛЬНЫМИ, ИЛИ ПОТЕРЯМИ, ПРИНЕСЕННЫМИ ИЗ-ЗА ВАС ИЛИ ТРЕТЬИХ ЛИЦ, 
///ИЛИ ОТКАЗОМ ПРОГРАММЫ РАБОТАТЬ СОВМЕСТНО С ДРУГИМИ ПРОГРАММАМИ), ДАЖЕ ЕСЛИ ТАКОЙ ВЛАДЕЛЕЦ ИЛИ ДРУГОЕ ЛИЦО БЫЛИ ИЗВЕЩЕНЫ О ВОЗМОЖНОСТИ ТАКИХ УБЫТКОВ.
///
///Copyright (c) 2021, https://github.com/Larii75 All rights reserved.
///
///Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:
///
///Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.
///Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
///Neither the name of the <ORGANIZATION> nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.
///THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, 
///THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER 
///OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, 
///PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
///LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
///EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

&НаСервере
Процедура СформироватьНаСервере(Табличный)
	
	Макет = Отчеты.ОтчетЗаказной.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	0 КАК Цифра
	|ПОМЕСТИТЬ Цифры
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&НаДату, МЕСЯЦ), ДЕНЬ, СписокДней.Дней) КАК Период
	|ПОМЕСТИТЬ Дни
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотниТысяч.Цифра * 100000 + ДесяткиТысяч.Цифра * 10000 + Тысячи.Цифра * 1000 + Сотни.Цифра * 100 + Десятки.Цифра * 10 + Единицы.Цифра КАК Дней
	|	ИЗ
	|		Цифры КАК СотниТысяч
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цифры КАК ДесяткиТысяч
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цифры КАК Тысячи
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цифры КАК Сотни
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цифры КАК Десятки
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цифры КАК Единицы
	|							ПО (Десятки.Цифра * 10 <= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НаДату, МЕСЯЦ), &НаДату, ДЕНЬ))
	|								И (Единицы.Цифра <= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НаДату, МЕСЯЦ), &НаДату, ДЕНЬ))
	|						ПО (Сотни.Цифра * 100 <= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НаДату, МЕСЯЦ), &НаДату, ДЕНЬ))
	|					ПО (Тысячи.Цифра * 1000 <= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НаДату, МЕСЯЦ), &НаДату, ДЕНЬ))
	|				ПО (ДесяткиТысяч.Цифра * 10000 <= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НаДату, МЕСЯЦ), &НаДату, ДЕНЬ))
	|			ПО (СотниТысяч.Цифра * 100000 <= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НаДату, МЕСЯЦ), &НаДату, ДЕНЬ))
	|	ГДЕ
	|		СотниТысяч.Цифра * 100000 + ДесяткиТысяч.Цифра * 10000 + Тысячи.Цифра * 1000 + Сотни.Цифра * 100 + Десятки.Цифра * 10 + Единицы.Цифра <= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НаДату, МЕСЯЦ), &НаДату, ДЕНЬ)) КАК СписокДней
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Движения.СредствоРазмещения КАК СредствоРазмещения,
	|	Движения.ЭтажСредстваРазмещения КАК ЭтажСредстваРазмещения,
	|	Движения.КомнатаСредстваРазмещения КАК КомнатаСредстваРазмещения,
	|	ДНИ.Период КАК Период,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|			КОГДА Движения.Период = НАЧАЛОПЕРИОДА(&НаДату, МЕСЯЦ)
	|				ТОГДА Движения.КоличествоКонечныйОстаток
	|			
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Движения.Период <= ДНИ.Период
	|						ТОГДА Движения.КоличествоОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ, 0)) КАК КоличествоКонечныйОстаток
	|ПОМЕСТИТЬ ОборотыПоДням
	|ИЗ
	|	Дни КАК ДНИ,
	|	РегистрНакопления.ОстаткиПроживающихГостей.ОстаткиИОбороты(НАЧАЛОПЕРИОДА(&НаДату, МЕСЯЦ), &НаДату, День, ДвиженияИГраницыПериода, ) КАК Движения
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.СредствоРазмещения,
	|	Движения.ЭтажСредстваРазмещения,
	|	Движения.КомнатаСредстваРазмещения,
	|	ДНИ.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыПоДням.СредствоРазмещения КАК СредствоРазмещения,
	|	ОборотыПоДням.ЭтажСредстваРазмещения КАК ЭтажСредстваРазмещения,
	|	ОборотыПоДням.КомнатаСредстваРазмещения КАК КомнатаСредстваРазмещения,
	|	СУММА(ОборотыПоДням.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток
	|ПОМЕСТИТЬ СуммаОборотовПоДням
	|ИЗ
	|	ОборотыПоДням КАК ОборотыПоДням
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыПоДням.СредствоРазмещения,
	|	ОборотыПоДням.ЭтажСредстваРазмещения,
	|	ОборотыПоДням.КомнатаСредстваРазмещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиМестРазмещенияВЭксплуатацииОстатки.КомнатаСредстваРазмещения КАК Комната,
	|	"""" КАК Бронирующий, //Предназначение
	|	СУММА(ОстаткиМестРазмещенияВЭксплуатацииОстатки.КоличествоОстаток) КАК СколькоМест,
	|	СУММА(ОстаткиМестРазмещенияОстатки.КоличествоОстаток) КАК СколькоСвободных,
	|	"""" КАК Примечание,
	|	"""" КАК БронирующийЗаселение, //Компании
	|	СУММА(СуммаОборотовПоДням.КоличествоКонечныйОстаток) КАК ОборотИтог,
	|	ОстаткиМестРазмещенияВЭксплуатацииОстатки.СредствоРазмещения КАК СредствоРазмещения,
	|	ОстаткиМестРазмещенияВЭксплуатацииОстатки.ЭтажСредстваРазмещения КАК ЭтажСредстваРазмещения
	|ПОМЕСТИТЬ ИТОГ
	|ИЗ
	|	РегистрНакопления.ОстаткиМестРазмещения.Остатки(&НаДату, Бронирование = ЗНАЧЕНИЕ(Документ.Бронирование.ПустаяССылка)) КАК ОстаткиМестРазмещенияОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМестРазмещенияВЭксплуатации.Остатки(&НаДату, ) КАК ОстаткиМестРазмещенияВЭксплуатацииОстатки
	|		ПО (ОстаткиМестРазмещенияВЭксплуатацииОстатки.СредствоРазмещения = ОстаткиМестРазмещенияОстатки.СредствоРазмещения)
	|			И (ОстаткиМестРазмещенияВЭксплуатацииОстатки.ЭтажСредстваРазмещения = ОстаткиМестРазмещенияОстатки.ЭтажСредстваРазмещения)
	|			И (ОстаткиМестРазмещенияВЭксплуатацииОстатки.КомнатаСредстваРазмещения = ОстаткиМестРазмещенияОстатки.КомнатаСредстваРазмещения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаОборотовПоДням КАК СуммаОборотовПоДням
	|		ПО (ОстаткиМестРазмещенияВЭксплуатацииОстатки.СредствоРазмещения = СуммаОборотовПоДням.СредствоРазмещения)
	|			И (ОстаткиМестРазмещенияВЭксплуатацииОстатки.ЭтажСредстваРазмещения = СуммаОборотовПоДням.ЭтажСредстваРазмещения)
	|			И (ОстаткиМестРазмещенияВЭксплуатацииОстатки.КомнатаСредстваРазмещения = СуммаОборотовПоДням.КомнатаСредстваРазмещения)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиМестРазмещенияВЭксплуатацииОстатки.КомнатаСредстваРазмещения,
	|	ОстаткиМестРазмещенияОстатки.КоличествоОстаток,
	|	ОстаткиМестРазмещенияВЭксплуатацииОстатки.СредствоРазмещения,
	|	ОстаткиМестРазмещенияВЭксплуатацииОстатки.ЭтажСредстваРазмещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИТОГ.Комната КАК КомнатаСредстваРазмещения,
	|	ИТОГ.СредствоРазмещения КАК СредствоРазмещения,
	|	ИТОГ.ЭтажСредстваРазмещения КАК ЭтажСредстваРазмещения,
	|	ОборотыБронирования.Бронирующий КАК Бронирующий
	|ПОМЕСТИТЬ ПРЕДНАЗНАЧЕНИЕ
	|ИЗ
	|	ИТОГ КАК ИТОГ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыБронирования КАК ОборотыБронирования
	|		ПО ИТОГ.СредствоРазмещения = ОборотыБронирования.СредствоРазмещения
	|			И ИТОГ.ЭтажСредстваРазмещения = ОборотыБронирования.ЭтажСредстваРазмещения
	|			И ИТОГ.Комната = ОборотыБронирования.КомнатаСредстваРазмещения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|///Нужно переделать на другой регистр....
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИТОГ.Комната КАК КомнатаСредстваРазмещения,
	|	ИТОГ.СредствоРазмещения КАК СредствоРазмещения,
	|	ИТОГ.ЭтажСредстваРазмещения КАК ЭтажСредстваРазмещения,
	|	ДокументБронирование.Бронирующий КАК Бронирующий
	|ПОМЕСТИТЬ КОМПАНИИ
	|ИЗ
	|	ИТОГ КАК ИТОГ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыЗаселения КАК ОборотыЗаселения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Бронирование КАК ДокументБронирование
	|			ПО ОборотыЗаселения.Бронирование = ДокументБронирование.Ссылка
	|		ПО ИТОГ.СредствоРазмещения = ОборотыЗаселения.СредствоРазмещения
	|			И ИТОГ.ЭтажСредстваРазмещения = ОборотыЗаселения.ЭтажСредстваРазмещения
	|			И ИТОГ.Комната = ОборотыЗаселения.КомнатаСредстваРазмещения";
	
	Запрос.Параметры.Вставить("НаДату", Отчет.Дата);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	СтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
	
	Табличный.Очистить();
	ВставлятьРазделительСтраниц = Ложь;
	
	ОбластьЗаголовок.Параметры.НаДату = Формат(Отчет.Дата, "ДФ=dd.MM.yyyy");
	Табличный.Вывести(ОбластьЗаголовок);
	Табличный.Вывести(ШапкаТаблицы);
	
	Пакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	ТаблицаПредназначение = Пакет[5].Выгрузить();
	ТаблицаКомпании = Пакет[6].Выгрузить();
	Выборка = Пакет[4].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			Табличный.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		СтрокаТаблицы.Параметры.Заполнить(Выборка);
		СтрокиПредназначения = ТаблицаПредназначение.НайтиСтроки(Новый Структура("СредствоРазмещения, ЭтажСредстваРазмещения, КомнатаСредстваРазмещения", Выборка.СредствоРазмещения, Выборка.ЭтажСредстваРазмещения, Выборка.Комната));
		СтрокаКонкатенацииПредназначение = СтрСоединить(ТаблицаПредназначение.Скопировать(СтрокиПредназначения, "Бронирующий").ВыгрузитьКолонку("Бронирующий"), ", ");
		СтрокаТаблицы.Параметры.Бронирующий = СтрокаКонкатенацииПредназначение;
		
		СтрокиКомпании = ТаблицаКомпании.НайтиСтроки(Новый Структура("СредствоРазмещения, ЭтажСредстваРазмещения, КомнатаСредстваРазмещения", Выборка.СредствоРазмещения, Выборка.ЭтажСредстваРазмещения, Выборка.Комната));
		СтрокаКонкатенацииКомпании = СтрСоединить(ТаблицаКомпании.Скопировать(СтрокиПредназначения, "Бронирующий").ВыгрузитьКолонку("Бронирующий"), ", ");
		СтрокаТаблицы.Параметры.БронирующийЗаселение = СтрокаКонкатенацииКомпании;
		
		Табличный.Вывести(СтрокаТаблицы, Выборка.Уровень());
		
		ВставлятьРазделительСтраниц = Истина;
		Табличный.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Табличный = Новый ТабличныйДокумент;
	СформироватьНаСервере(Табличный);
	Табличный.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Табличный.ОтображатьСетку = Ложь;
	Табличный.Защита = Истина;
	Табличный.ТолькоПросмотр = Ложь;
	Табличный.ОтображатьЗаголовки = Ложь;
	Табличный.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Дата = ТекущаяДата();
	НаДату.Дата = КонецДня(Отчет.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	
	Отчет.Дата = КонецДня(НаДату.Дата);
	
КонецПроцедуры
